export const questions = [
	{
		title: 'React - это ?',
		variants: ['библиотека', 'фреймворк', 'приложение'],
		correct: 0,
	},
	{
		title: 'Компонент - это ?',
		variants: [
			'приложение',
			'часть приложения или страницы',
			'то, что я не знаю что такое',
		],
		correct: 1,
	},
	{
		title: 'Что такое JSX?',
		variants: [
			'это простой HTML',
			'это функция',
			'это тот же HTML, но с возможностью выполнять JS-код',
		],
		correct: 2,
	},
	{
		title: 'Сколько типов данных в Javascript ?',
		variants: ['5', '7', '8'],
		correct: 2,
	},
	{
		title: 'Что такое свойство объекта ?',
		variants: [' ключ - значение', 'результат - значение', 'значение - имя'],
		correct: 0,
	},
	{
		title: 'Что такое метод в Javascript ?',
		variants: [
			'свойство',
			'свойство объекта значением которого является функция',
			'набор вводных данных объекта',
		],
		correct: 1,
	},
	{
		title: 'Сколько способов объявления переменной в Javascript?',
		variants: [3, 2, 5, 4],
		correct: 3,
	},
	{
		title: 'Что такое область видимости в Javascript ?',
		variants: [
			'границы действия переменной',
			"действия глобально",
			'видимость функции ',
		],
		correct: 0,
	},
	{
		title: 'Что возвращает выражение ?',
		variants: ['число', "строку", 'значение'],
		correct: 2,
	},
	{
		title: 'Что означает второй параметр метода reduce ?',
		variants: [
			'начальное значение аккумулятор',
			'повторение метода',
			'результат выполнения',
		],
		correct: 0,
	},
]
